# FamilyCurveGstyleFor2010Mass Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FamilyCurveGstyleFor2010Mass Property
ParameterTypeId Class See Also
---
"Subcategory"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FamilyCurveGstyleFor2010Mass { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyCurveGstyleFor2010Mass As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FamilyCurveGstyleFor2010Mass {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace